weather_condition = {
    "clear": "ясно",
    "partly-cloudy": "малооблачно",
    "cloudy": "облачно с прояснениями",
    "overcast": "пасмурно",
    "drizzle": "морось",
    "light-rain": "небольшой дождь",
    "rain": "дождь",
    "moderate-rain": "умеренно сильный дождь",
    "heavy-rain": "сильный дождь",
    "continuous-heavy-rain": "длительный сильный дождь",
    "showers": "ливень",
    "wet-snow": "дождь со снегом",
    "light-snow": "небольшой снег",
    "snow": "снег",
    "snow-showers": "снегопад",
    "hail": "град",
    "thunderstorm": "гроза",
    "thunderstorm-with-rain": "дождь с грозой",
    "thunderstorm-with-hail": "гроза с градом",
}

prec_type = {0: "без осадков", 1: "дождь", 2: "дождь со снегом", 3: "снег", 4: "град"}

prec_snow_strength = {
    0: "без осадков",
    0.25: "слабый снег",
    0.5: "снег",
    0.75: "сильный снег",
    1: "очень сильный снег",
}

prec_rain_strength = {
    0: "без осадков",
    0.25: "слабый дождь",
    0.5: "дождь",
    0.75: "сильный дождь",
    1: "сильный ливень",
}

cloudness = {
    0: "ясно",
    0.25: "малооблачно",
    0.5: "облачно с прояснениями",
    0.75: "облачно с прояснениями",
    1: "пасмурно",
}
